liuqhi/STM32/DL-0-187-T-0-9-v1/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RTC_CLK_Pin GPIO_PIN_0
#define RTC_CLK_GPIO_Port GPIOC
#define DE_CPU_2_Pin GPIO_PIN_1
#define DE_CPU_2_GPIO_Port GPIOA
#define MOTOR_CONT_1_Pin GPIO_PIN_6
#define MOTOR_CONT_1_GPIO_Port GPIOA
#define MOTOR_CONT_2_Pin GPIO_PIN_7
#define MOTOR_CONT_2_GPIO_Port GPIOA
#define RESERVE_Pin GPIO_PIN_5
#define RESERVE_GPIO_Port GPIOC
#define TRIGGER_Pin GPIO_PIN_0
#define TRIGGER_GPIO_Port GPIOB
#define TEV_SWITCH_Pin GPIO_PIN_1
#define TEV_SWITCH_GPIO_Port GPIOB
#define DE_CPU_1_Pin GPIO_PIN_9
#define DE_CPU_1_GPIO_Port GPIOC
#define POS_DETECTION_Pin GPIO_PIN_12
#define POS_DETECTION_GPIO_Port GPIOC
#define DISTENCE_DETECTION_Pin GPIO_PIN_2
#define DISTENCE_DETECTION_GPIO_Port GPIOD
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
